In [1]:
# Dependencies
import pandas as pd
import numpy as np

In [2]:
# create df

df = pd.read_csv('movie_sales.csv')

In [3]:
#delete the one unnecessary column

del df['studio']

In [4]:
#make titles lower case

df['title'] = df['title'].str.lower()


df.head()

   rank                         title  lifetime_gross  year
0     1  star wars: the force awakens       936662225  2015
1     2                        avatar       760507625  2009
2     3                 black panther       700059566  2018
3     4        avengers: infinity war       678681680  2018
4     5                       titanic       659363944  1997

In [5]:
# save to csv

df.to_csv('movie_sales_v2.csv')

In [7]:
df.describe()

               rank  lifetime_gross          year
count  15743.000000    1.574300e+04  15743.000000
mean    7872.000000    1.798157e+07   2003.475259
std     4544.756979    4.558019e+07     11.154350
min        1.000000    3.000000e+01   1921.000000
25%     3936.500000    5.517700e+04   1997.000000
50%     7872.000000    8.731960e+05   2006.000000
75%    11807.500000    1.496974e+07   2013.000000
max    15743.000000    9.366622e+08   2018.000000